//dz1: Напишите программу, которая выводит случайное трёхзначное число
// и удаляет вторую цифру этого числа.
// 456 -> 46
// 782 -> 72
// 918 -> 98

//int a = 456;
//int a1 = a%10;
//int a2 = a/100;
//Console.WriteLine($"{a2}{a1}");



//dz2: Напишите программу, которая выводит третью
//цифру заданного числа или сообщает, что третьей цифры
//нет.

//645 -> 5
//78 -> третьей цифры нет
//32679 -> 6


//int Number = 645;

//Console.WriteLine($"Дано число: {Number}");

//if (Number >99) Console.WriteLine($"Третьей цифрой числа {Number} будет цифра {Number /100 %10}");
//else Console.WriteLine($"У числа {Number} нет третьей цифры");

//Console.WriteLine();