Console.WriteLine("введите номер четверти");
int a = int.Parse(Console.ReadLine());
if (a>4| a<1)
{
    Console.WriteLine("Ввели не правилльно значение");
}
else if (a == 1)
{
    Console.WriteLine($"четверти{a} принадлежат точки х от 1 до бесконечности, точки у от 1 до бесконечности");
}
else if (a == 2)
{
    Console.WriteLine($"четверти{a} принадлежат точки х от -1 до -бесконечности, точки у от 1 до бесконечности");
}

else if (a == 3)
{
    Console.WriteLine($"четверти{a} принадлежат точки х от -1 до -бесконечности, точки у от -1 до -бесконечности");
}
else if (a == 4)
{
    Console.WriteLine($"четверти{a} принадлежат точки х от 1 до бесконечности, точки у от -1 до -бесконечности");
}

